{"class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "go_backwards": false, "recurrent_dropout": 0.2, "use_bias": true, "recurrent_constraint": null, "stateful": false, "trainable": true, "units": 128, "kernel_constraint": null, "name": "gru_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 40, 50], "implementation": 0, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "unroll": false}}, {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.2, "use_bias": true, "recurrent_constraint": null, "stateful": false, "trainable": true, "units": 128, "kernel_constraint": null, "name": "gru_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "unroll": false}}, {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.2, "use_bias": true, "recurrent_constraint": null, "stateful": false, "trainable": true, "units": 128, "kernel_constraint": null, "name": "gru_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "unroll": false}}, {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.2, "use_bias": true, "recurrent_constraint": null, "stateful": false, "trainable": true, "units": 128, "kernel_constraint": null, "name": "gru_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "unroll": false}}, {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.2, "use_bias": true, "recurrent_constraint": null, "stateful": false, "trainable": true, "units": 128, "kernel_constraint": null, "name": "gru_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 0, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "unroll": false}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "units": 2, "kernel_constraint": null, "name": "dense_1"}}], "backend": "tensorflow", "keras_version": "2.0.8"}