{"backend": "tensorflow", "config": [{"config": {"padding": "valid", "trainable": true, "filters": 512, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_1", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "batch_input_shape": [null, 40, 50], "dtype": "float32", "kernel_size": [2], "strides": [1], "activation": "relu"}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "trainable": true, "filters": 512, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_2", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [2], "strides": [1], "activation": "relu"}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "trainable": true, "filters": 512, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "conv1d_3", "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_size": [1], "strides": [1], "activation": "relu"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_average_pooling1d_1"}, "class_name": "GlobalAveragePooling1D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"units": 2, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential"}