{"keras_version": "2.0.8", "config": [{"config": {"batch_input_shape": [null, 40, 50], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "filters": 512, "kernel_size": [3], "dtype": "float32", "name": "conv1d_1", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1], "use_bias": true, "dilation_rate": [1], "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"config": {"activation": "relu", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "dilation_rate": [1], "kernel_size": [3], "name": "conv1d_2", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "strides": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"config": {"activation": "relu", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 512, "kernel_constraint": null, "dilation_rate": [1], "kernel_size": [3], "name": "conv1d_3", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "strides": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "global_average_pooling1d_1"}, "class_name": "GlobalAveragePooling1D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "softmax", "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}