{"config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_dropout": 0.2, "name": "gru_1", "batch_input_shape": [null, 40, 50], "activation": "tanh", "use_bias": true, "implementation": 0, "recurrent_constraint": null, "unroll": false, "stateful": false, "bias_constraint": null, "kernel_constraint": null, "return_sequences": true, "units": 256, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "return_state": false, "dtype": "float32"}, "class_name": "GRU"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "bias_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_dropout": 0.2, "name": "gru_2", "trainable": true, "use_bias": true, "implementation": 0, "recurrent_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_constraint": null, "return_sequences": true, "units": 256, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "stateful": false, "kernel_regularizer": null, "return_state": false}, "class_name": "GRU"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "bias_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_dropout": 0.2, "name": "gru_3", "trainable": true, "use_bias": true, "implementation": 0, "recurrent_constraint": null, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_constraint": null, "return_sequences": true, "units": 256, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "stateful": false, "kernel_regularizer": null, "return_state": false}, "class_name": "GRU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 512}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2", "trainable": true, "use_bias": true, "kernel_regularizer": null, "units": 2}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}