{"config": [{"config": {"use_bias": true, "batch_input_shape": [null, 40, 50], "bias_regularizer": null, "dropout": 0.3, "units": 256, "activation": "tanh", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "unroll": false, "bias_constraint": null, "stateful": false, "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.3, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "dtype": "float32", "name": "gru_1", "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "GRU"}, {"config": {"use_bias": true, "go_backwards": false, "activation": "tanh", "dropout": 0.3, "units": 256, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "unroll": false, "bias_constraint": null, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.3, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "name": "gru_2", "implementation": 0, "recurrent_constraint": null}, "class_name": "GRU"}, {"config": {"use_bias": true, "go_backwards": false, "activation": "tanh", "dropout": 0.3, "units": 256, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "return_sequences": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "unroll": false, "bias_constraint": null, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.3, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "name": "gru_3", "implementation": 0, "recurrent_constraint": null}, "class_name": "GRU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activation": "relu", "units": 512, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "softmax", "units": 2, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}