{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dropout": 0.2, "activation": "tanh", "return_sequences": true, "unroll": false, "trainable": true, "units": 128, "name": "gru_1", "dtype": "float32", "recurrent_dropout": 0.2, "recurrent_constraint": null, "batch_input_shape": [null, 40, 50], "recurrent_regularizer": null, "go_backwards": false, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 0, "recurrent_activation": "hard_sigmoid", "use_bias": true}}, {"class_name": "GRU", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dropout": 0.2, "activation": "tanh", "return_sequences": true, "unroll": false, "trainable": true, "units": 128, "name": "gru_2", "stateful": false, "recurrent_dropout": 0.2, "recurrent_constraint": null, "implementation": 0, "recurrent_regularizer": null, "go_backwards": false, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "use_bias": true}}, {"class_name": "GRU", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dropout": 0.2, "activation": "tanh", "return_sequences": true, "unroll": false, "trainable": true, "units": 128, "name": "gru_3", "stateful": false, "recurrent_dropout": 0.2, "recurrent_constraint": null, "implementation": 0, "recurrent_regularizer": null, "go_backwards": false, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "use_bias": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 512, "name": "dense_1", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "softmax", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 2, "name": "dense_2", "use_bias": true}}], "keras_version": "2.0.8"}