{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "relu", "units": 512, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "batch_input_shape": [null, 7], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "softmax", "units": 2, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}]}