{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "GRU", "config": {"dtype": "float32", "unroll": false, "recurrent_dropout": 0.1, "stateful": false, "dropout": 0.1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 256, "kernel_constraint": null, "name": "gru_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_regularizer": null, "recurrent_constraint": null, "batch_input_shape": [null, 40, 50], "implementation": 0}}, {"class_name": "GRU", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "recurrent_dropout": 0.1, "stateful": false, "dropout": 0.1, "implementation": 0, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 256, "kernel_constraint": null, "name": "gru_2", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_regularizer": null, "recurrent_constraint": null}}, {"class_name": "GRU", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "recurrent_dropout": 0.2, "stateful": false, "dropout": 0.2, "implementation": 0, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "kernel_constraint": null, "name": "gru_3", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_regularizer": null, "recurrent_constraint": null}}, {"class_name": "GRU", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "unroll": false, "recurrent_dropout": 0.2, "stateful": false, "dropout": 0.2, "implementation": 0, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "kernel_constraint": null, "name": "gru_4", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "bias_regularizer": null, "recurrent_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 2, "kernel_constraint": null}}]}